In [1]:
!pip install pymongo

Collecting pymongo
  Downloading pymongo-4.1.1-cp39-cp39-win_amd64.whl (365 kB)
     ------------------------------------- 365.3/365.3 kB 11.5 MB/s eta 0:00:00
Installing collected packages: pymongo
Successfully installed pymongo-4.1.1

WARNING: There was an error checking the latest version of pip.

In [15]:
import pandas as pd
import pymongo
myclient = pymongo.MongoClient("mongodb://localhost:27017/")
mydb = myclient["mydatabase"]

In [6]:
mycol = mydb["customers"]

### Checking for Collections

In [7]:
collist = mydb.list_collection_names()
print(collist)
if "customers" in collist:
    print("The collection exists.")

['customers']
The collection exists.

### Insert Data

In [8]:
mydict = { "name": "John", "address": "Highway 37" }
x = mycol.insert_one(mydict)
print(x.inserted_id)

629f213a9c07f55127337c8b

### Insert Multiple Documents

In [9]:
mylist = [
  { "name": "Amy", "address": "Apple st 652"},
  { "name": "Hannah", "address": "Mountain 21"},
  { "name": "Michael", "address": "Valley 345"},
  { "name": "Sandy", "address": "Ocean blvd 2"},
  { "name": "Betty", "address": "Green Grass 1"},
  { "name": "Richard", "address": "Sky st 331"},
  { "name": "Susan", "address": "One way 98"},
  { "name": "Vicky", "address": "Yellow Garden 2"},
  { "name": "Ben", "address": "Park Lane 38"},
  { "name": "William", "address": "Central st 954"},
]

x = mycol.insert_many(mylist)
print(x.inserted_ids)

[ObjectId('629f213c9c07f55127337c8c'), ObjectId('629f213c9c07f55127337c8d'), ObjectId('629f213c9c07f55127337c8e'), ObjectId('629f213c9c07f55127337c8f'), ObjectId('629f213c9c07f55127337c90'), ObjectId('629f213c9c07f55127337c91'), ObjectId('629f213c9c07f55127337c92'), ObjectId('629f213c9c07f55127337c93'), ObjectId('629f213c9c07f55127337c94'), ObjectId('629f213c9c07f55127337c95')]

### Find First Data

In [13]:
one_data = mycol.find_one()
print(one_data)

{'_id': ObjectId('629df4bd221f6ef336ffb9e1'), 'name': 'John', 'address': 'Highway 37'}

In [17]:
df = pd.DataFrame(list(one_data))
print(df)

         0
0      _id
1     name
2  address

### Find All

In [11]:
for x in mycol.find():
    print(x)

{'_id': ObjectId('629df4bd221f6ef336ffb9e1'), 'name': 'John', 'address': 'Highway 37'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e2'), 'name': 'Amy', 'address': 'Apple st 652'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e3'), 'name': 'Hannah', 'address': 'Mountain 21'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e4'), 'name': 'Michael', 'address': 'Canyon 123'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e5'), 'name': 'Sandy', 'address': 'Ocean blvd 2'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e6'), 'name': 'Betty', 'address': 'Green Grass 1'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e7'), 'name': 'Minnie', 'address': 'Sky st 331'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e8'), 'name': 'Susan', 'address': 'One way 98'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e9'), 'name': 'Vicky', 'address': 'Yellow Garden 2'}
{'_id': ObjectId('629df4ef221f6ef336ffb9ea'), 'name': 'Ben', 'address': 'Park Lane 38'}
{'_id': ObjectId('629df4ef221f6ef336ffb9eb'), 'name': 'William', 'address': 'Central st 954'}
{'_id': ObjectId('629f13629c07f55127337c89'), 'name': 'John', 'address': 'Highway 37'}
{'_id': ObjectId('629f213a9c07f55127337c8b'), 'name': 'John', 'address': 'Highway 37'}
{'_id': ObjectId('629f213c9c07f55127337c8c'), 'name': 'Amy', 'address': 'Apple st 652'}
{'_id': ObjectId('629f213c9c07f55127337c8d'), 'name': 'Hannah', 'address': 'Mountain 21'}
{'_id': ObjectId('629f213c9c07f55127337c8e'), 'name': 'Michael', 'address': 'Valley 345'}
{'_id': ObjectId('629f213c9c07f55127337c8f'), 'name': 'Sandy', 'address': 'Ocean blvd 2'}
{'_id': ObjectId('629f213c9c07f55127337c90'), 'name': 'Betty', 'address': 'Green Grass 1'}
{'_id': ObjectId('629f213c9c07f55127337c91'), 'name': 'Richard', 'address': 'Sky st 331'}
{'_id': ObjectId('629f213c9c07f55127337c92'), 'name': 'Susan', 'address': 'One way 98'}
{'_id': ObjectId('629f213c9c07f55127337c93'), 'name': 'Vicky', 'address': 'Yellow Garden 2'}
{'_id': ObjectId('629f213c9c07f55127337c94'), 'name': 'Ben', 'address': 'Park Lane 38'}
{'_id': ObjectId('629f213c9c07f55127337c95'), 'name': 'William', 'address': 'Central st 954'}

In [34]:
df = pd.DataFrame(list( mycol.find())).reset_index(drop=True)
display(df.head())

                        _id     name       address
0  629df4bd221f6ef336ffb9e1     John    Highway 37
1  629df4ef221f6ef336ffb9e2      Amy  Apple st 652
2  629df4ef221f6ef336ffb9e3   Hannah   Mountain 21
3  629df4ef221f6ef336ffb9e4  Michael    Canyon 123
4  629df4ef221f6ef336ffb9e5    Sandy  Ocean blvd 2

### Filter the Result

In [35]:
myquery = {"address": "Park Lane 38"}
mydoc = mycol.find(myquery)

for x in mydoc:
    print(x)

{'_id': ObjectId('629df4ef221f6ef336ffb9ea'), 'name': 'Ben', 'address': 'Park Lane 38'}
{'_id': ObjectId('629f213c9c07f55127337c94'), 'name': 'Ben', 'address': 'Park Lane 38'}

In [32]:
df = pd.DataFrame(list(mycol.find(myquery))).reset_index(drop=True)
display(df)

                        _id name       address
0  629df4ef221f6ef336ffb9ea  Ben  Park Lane 38
1  629f213c9c07f55127337c94  Ben  Park Lane 38

### Sort the Data

In [12]:
mydoc = mycol.find().sort("name")

for x in mydoc:
    print(x)

{'_id': ObjectId('629df4ef221f6ef336ffb9e2'), 'name': 'Amy', 'address': 'Apple st 652'}
{'_id': ObjectId('629df4ef221f6ef336ffb9ea'), 'name': 'Ben', 'address': 'Park Lane 38'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e6'), 'name': 'Betty', 'address': 'Green Grass 1'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e3'), 'name': 'Hannah', 'address': 'Mountain 21'}
{'_id': ObjectId('629df4bd221f6ef336ffb9e1'), 'name': 'John', 'address': 'Highway 37'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e4'), 'name': 'Michael', 'address': 'Valley 345'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e7'), 'name': 'Richard', 'address': 'Sky st 331'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e5'), 'name': 'Sandy', 'address': 'Ocean blvd 2'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e8'), 'name': 'Susan', 'address': 'One way 98'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e9'), 'name': 'Vicky', 'address': 'Yellow Garden 2'}
{'_id': ObjectId('629df4ef221f6ef336ffb9eb'), 'name': 'William', 'address': 'Central st 954'}

In [38]:
df = pd.DataFrame(list(mycol.find().sort("name"))).reset_index(drop=True)
display(df.head())

                        _id   name        address
0  629df4ef221f6ef336ffb9e2    Amy   Apple st 652
1  629f213c9c07f55127337c8c    Amy   Apple st 652
2  629df4ef221f6ef336ffb9ea    Ben   Park Lane 38
3  629f213c9c07f55127337c94    Ben   Park Lane 38
4  629df4ef221f6ef336ffb9e6  Betty  Green Grass 1

### Limit

In [13]:
myresult = mycol.find().limit(5)
#print the result:
for x in myresult:
    print(x)

{'_id': ObjectId('629df4bd221f6ef336ffb9e1'), 'name': 'John', 'address': 'Highway 37'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e2'), 'name': 'Amy', 'address': 'Apple st 652'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e3'), 'name': 'Hannah', 'address': 'Mountain 21'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e4'), 'name': 'Michael', 'address': 'Valley 345'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e5'), 'name': 'Sandy', 'address': 'Ocean blvd 2'}

In [39]:
df = pd.DataFrame(list(mycol.find().limit(5))).reset_index(drop=True)
display(df.head())

                        _id     name       address
0  629df4bd221f6ef336ffb9e1     John    Highway 37
1  629df4ef221f6ef336ffb9e2      Amy  Apple st 652
2  629df4ef221f6ef336ffb9e3   Hannah   Mountain 21
3  629df4ef221f6ef336ffb9e4  Michael    Canyon 123
4  629df4ef221f6ef336ffb9e5    Sandy  Ocean blvd 2

### Update Collection

In [14]:
myquery = { "address": "Valley 345" }
newvalues = {"$set": {"address": "Canyon 123" } }

mycol.update_one(myquery, newvalues)

#print "customers" after the update:
for x in mycol.find():
    print(x)

{'_id': ObjectId('629df4bd221f6ef336ffb9e1'), 'name': 'John', 'address': 'Highway 37'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e2'), 'name': 'Amy', 'address': 'Apple st 652'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e3'), 'name': 'Hannah', 'address': 'Mountain 21'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e4'), 'name': 'Michael', 'address': 'Canyon 123'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e5'), 'name': 'Sandy', 'address': 'Ocean blvd 2'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e6'), 'name': 'Betty', 'address': 'Green Grass 1'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e7'), 'name': 'Richard', 'address': 'Sky st 331'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e8'), 'name': 'Susan', 'address': 'One way 98'}
{'_id': ObjectId('629df4ef221f6ef336ffb9e9'), 'name': 'Vicky', 'address': 'Yellow Garden 2'}
{'_id': ObjectId('629df4ef221f6ef336ffb9ea'), 'name': 'Ben', 'address': 'Park Lane 38'}
{'_id': ObjectId('629df4ef221f6ef336ffb9eb'), 'name': 'William', 'address': 'Central st 954'}

### Update Many

In [15]:
myquery = { "address": { "$regex": "^S" } }
newvalues = { "$set": { "name": "Minnie" } }

x = mycol.update_many(myquery, newvalues)

print(x.modified_count, "documents updated.")

1 documents updated.

### Delete Multiple Document

In [40]:
myquery = { "address": {"$regex": "^S"} }

x = mycol.delete_many(myquery)

print(x.deleted_count, " documents deleted.")

### Delete Collection

In [ ]:
mycol.drop()

### CSV to MongoDB

In [ ]:
titanic_data=pd.read_csv('data/titanic')
myCollection.insert_many(data_dict)